{"meta":{"title":"DevTechUp","subtitle":null,"description":"Developer technology. Programming code.","author":"DevTechUp","url":"https://www.devtechup.com"},"pages":[],"posts":[{"title":"Best code review tool recommended","slug":"Code-Review-tool-recommended","date":"2017-08-02T16:19:00.000Z","updated":"2017-08-01T16:42:09.000Z","comments":true,"path":"2017/08/03/Code-Review-tool-recommended/","link":"","permalink":"https://www.devtechup.com/2017/08/03/Code-Review-tool-recommended/","excerpt":"","text":"Recently thinking about a question, how to carry out efficient codereview, there is no good tool can be used, so spent two or three days in Google Amoy a lot, here left a record. PhabricatorThe first codereview tool, of course, is not limited to codereview, this tool I experienced the next, the function is very powerful. In addition to codereview, there are tasks, bug management, wiki management, project management and other functions, but also custom features, the interface is also very refreshing. Personally feel that there is almost nothing to picky place, if just need a set of tools with each other team, choose this is wrong. (If it is me, I am more inclined to this tool) Experience Phabricator ReviewNinjaJust began to experience this tool, purely because of curiosity, was attracted to the name: English Japanese pronunciation, plus I was a fire fan … … experience after feeling really good. This tool is very lightweight, and only supports github, it is suitable for individuals, small teams to use. Focus on the codereview this function, the interface is also very refreshing, you can through some special comment symbols to github merge button to produce changes in response, but also change the github pr checks. If my scene is only github, then i would choose to use this tool, access is also very simple, open source free. CodacyThis tool is a bit like Phabricator, but this tool has the code quality statistics and suggestions, there are analysis, codereview function is also very full, there dashboard can list the various indicators of the project, very praise, the key is that this tool can dock github, bitbucket , Jira and Jenkins, but also docking hipchat and slack, etc., the function is very powerful, it is worth a good look. Personally feel that this tool is very broad scope of application, some of the quality of the project is not only limited to codereview can try to use a github on the public warehouse is free. Features Codacy experience RhodeCodeSupport git, svn, multi-warehouse management, interface experience is also relatively refreshing, features and codacy have a lot of overlap. RhodeCode Features Demo GerritThis is Google open source codereview tool, and Phabricator go hand in hand, but also very strong, but I personally do not like this interface style … … I do not have to go through this, just read some of the official website information, function does not lose Phabricator. Like a friend can go to experience a.","categories":[{"name":"Tool","slug":"Tool","permalink":"https://www.devtechup.com/categories/Tool/"},{"name":"Code review","slug":"Tool/Code-review","permalink":"https://www.devtechup.com/categories/Tool/Code-review/"}],"tags":[{"name":"code review","slug":"code-review","permalink":"https://www.devtechup.com/tags/code-review/"},{"name":"code","slug":"code","permalink":"https://www.devtechup.com/tags/code/"},{"name":"tool","slug":"tool","permalink":"https://www.devtechup.com/tags/tool/"}]}]}